import React from 'react';
import {Container,Title,SubTitle,Content} from './TermsOfUsePage.styled';

const TermsOfUsePage = () => {
  return (
    <Container>
      <Title>УМОВИ ВИКОРИСТАННЯ</Title>
      <Content>
        <SubTitle>1. Загальні умови</SubTitle>
        <p>
        1.1. Якщо ви вирішили користуватися Сайтом і додатками Сайту, включно з RSS, API, програмним забезпеченням та іншими файлами, ви надаєте згоду на дотримання всіх умов, викладених у цих Правилах користування сайтом (далі – Правила), у тому числі, шляхом реєстрації на Сайті вашого облікового запису (аккаунту). Ці Правила є юридично обов’язковою угодою між користувачем і Компанією, предметом якої є надання користувачеві послуг із використання Сайту та його сервісів.<br/>
        1.2. Ми можемо в будь-який час змінювати умови, викладені в цих Правилах, і такі зміни набирають чинності негайно після їх оприлюднення на Сайті.<br/>
        1.3. Ви зобов’язані ознайомлюватися з цими Правилами перед кожним користуванням Сайтом. Якщо ви продовжуєте користуватися Сайтом після оприлюднення змінених Правил, це означає вашу згоду на дотримання Правил із усіма їхніми змінами.<br/>
        1.4. Якщо будь-які умови цих Правил або зміни до них неприйнятні для вас, ви можете не розпочинати користування Сайтом або припинити дію вашого облікового запису в порядку, визначеному розділом 7 Правил.
        </p>
     
        <SubTitle>2. Контент Сайту</SubTitle>
        <p>
        2.1. Матеріали, опубліковані на Сайті, призначені для вашого особистого некомерційного використання. Усі матеріали, опубліковані на Сайті, включно з, але не обмежуючись: новини, фотографії, зображення, ілюстрації, аудіо- та відеокліпи (далі – «матеріали» або «контент») захищені авторським правом і знаходяться у володінні або під контролем Компанії або сторони, яка є постачальником контенту. Ви повинні дотримуватися всіх додаткових повідомлень про авторські права, інформації або обмежень, що містяться на будь-якій сторінці.<br/>
        2.2. Зміст Сайту захищений авторським правом відповідно до законодавства України та міжнародного авторського права. Ви не маєте права змінювати, публікувати, передавати, брати участь у передачі або продажу, відтворювати (за винятком випадків, передбачених в пункті 2.4 цих Правил), створювати нові твори, поширювати, виконувати, або яким-небудь чином використовувати зміст Сайту (включно з програмним забезпеченням) в цілому або частково.<br/>
        2.3. Комерційні (фірмові) найменування, торговельні марки тощо Компаній або третіх осіб захищені правами інтелектуальної власності. Ніщо, зазначене в цих Правилах, не може тлумачитися як надання опосередковано, за замовчуванням або іншим шляхом будь-якої ліцензії або права на використання торговельної марки, патенту, прав на дизайн або авторських прав Компанії або третіх осіб<br/>
        2.4. Ви можете завантажити або скопіювати вміст Сайту, інші компоненти та елементи, що відображаються на Сайті, тільки для особистого використання, за умови дотримання всіх авторських прав та інших повідомлень, що містяться в ньому. Копіювання чи зберігання будь-якого контенту для потреб, відмінних від особистого використання, суворо забороняється без попередньої письмової згоди Компанії.<br/>
        2.5. Інтернет-порталам, мобільним додаткам дозволяється безкоштовно використовувати інформацію, розміщену на Сайті, за умови відкритого гіперпосилання та згадки першоджерела та в обсязі, що не перевищує півтори тисячі знаків оригінального тексту. Використання більшого обсягу тексту можливе лише за умови отримання письмового дозволу Компанії. Під використанням інформації мається на увазі будь-яке відтворення, републікація, поширення, перероблення, переклад, включення його частин до інших творів та інші способи, передбачені Законом України «Про авторське право і суміжні права».
        </p>

        <SubTitle>3. Контент користувачів</SubTitle>
        <p>
        3.1. Ви погоджуєтесь користуватися Сайтом виключно с законною метою та таким чином, щоб не порушувати права інших користувачів, не обмежувати та не перешкоджати доступу інших до Сайту та користуванню ним.<br/>
        3.2. Не дозволяється завантажувати, розповсюджувати та публікувати контент будь-якого наклепницького, образливого, непристойного, порнографічного чи іншого незаконного матеріалу; рекламні прояви, комерційні повідомлення, а також повідомлення, які не мають інформаційного навантаження і не стосуються тематики ресурсу.<br/>
        3.3. Будьте ввічливі. Ви погоджуєтесь, що не будете погрожувати або ображати інших користувачів, використовуючи наклепницькі прийоми, або свідомо публікувати повідомлення з повторювальним змістом (спам). Користуйтеся шанобливою мовою. Онлайн-бесіда продовжуватиметься тільки тоді, коли наші користувачі відчують себе бажаними та в безпеці. Ви погоджуєтесь не використовувати мову, яка зловживає або розрізняє на підставі раси, релігії, національності, статі, сексуальних вподобань, віку, регіону, інвалідності і т.п. Ворожнеча будь-якого роду є підставою для негайного призупинення доступу до всього Сайту або його частини.<br/>
        3.4. Дискутуйте, але не нападайте. У суспільстві, повному думок та переваг, люди завжди розходяться в думках. Сайт пропонує активні обговорення і вітає жаркі дебати, але особистий напад є прямим порушенням Умов це є підставою для негайного призупинення повного або часткового доступу до всього Сайту.<br/>
        3.5. Не розголошуйте в своїх повідомленнях ніякої особистої інформації про себе або про будь-кого іншого (наприклад: телефонний номер, домашню адресу, адресу електронної пошти).<br/>
        3.6. Ви визнаєте, що будь-які матеріали поширені Вами (наприклад контент, створюваний Вами, в тому числі, але не обмежуючись: коментарі, форум, повідомлення, рецензії, текст, відео, аудіо та фотографій, а також комп'ютерний код і додатки) може бути видалений або змінений нами. Ви відмовляєтесь від будь-яких прав, які Ви можете мати в разі наявності такого матеріалу на Сайті, а зміна матеріалів може бути здійснена навіть у разі якщо Ви не згодні. Матеріали також можуть бути включені в наші RSS-канали, API, і доступні для перевидання через інші формати.<br/>
        3.7. Ви надаєте Компанії, безстрокову, невиключну, по всьому світу, роялті-фрі, ліцензію на розміщені/надіслані/поширені Вами матеріали, включаючи передачу Компанії або будь-якій третій стороні необмежене право на використання, копіювання, передання, публікацію, поширення, створення похідних робіт, змінення і адаптування індексу, кеша, тегів, кодування (включаючи без обмеження права на адаптацію до потокового завантаження, передачі, мобільного, цифрового сканування або інших технології) в будь-якій формі або засобах масової інформації, відомих зараз або в подальшому розроблених, в тому числі, будь-які статті, розміщені Вами на Сайті або на вебсайті, який належить Компанії.<br/>
        3.8. Ви несете повну відповідальність за зміст Ваших публікацій. Компанія не може контролювати кожен матеріал і не несе відповідальності за зміст цих повідомлень, Ми залишаємо за собою право видаляти, переміщати або редагувати статті, які Компанія, за власним розсудом, вважає образливими, наклепницькими, непристойними або неприйнятними, які порушують авторські права і товарні знаки.<br/>
        3.9. Ви даєте згоду на відображення і публікацію на Сайті розробленого Вами матеріалу, а також в рекламних цілях за межами Сайту.
        </p>
      </Content>
    </Container>
  );
};


export default TermsOfUsePage;
