const cityData = {
  regionsAndCities: {
    Київська: ['Київ', 'Біла-церква', 'Бровари', 'Ірпінь'],
    Вінницька: ['Вінниця', 'Хмельницький', 'Бар'],
    Волинська: ['Луцьк', 'Ковель', 'Нововолинськ'],
    Дніпропетровська: ['Дніпро', 'Кривий Ріг', 'Нікополь'],
    Донецька: ['Донецьк', 'Маріуполь', 'Макіївка'],
    Житомирська: ['Житомир', 'Коростень', 'Бердичів'],
    Закарпатська: ['Ужгород', 'Мукачево', 'Хуст'],
    Запорізька: ['Запоріжжя', 'Мелітополь', 'Бердянськ'],
    'Івано-Франківська': ['Івано-Франківськ', 'Яремче', 'Коломия'],
    Кіровоградська: ['Кропивницький', 'Світловодськ', 'Олександрія'],
    Луганська: ['Луганськ', 'Алчевськ', 'Северодонецьк'],
    Львівська: ['Львів', 'Дрогобич', 'Трускавець'],
    Миколаївська: ['Миколіїв', 'Первомайськ', 'Вознесенськ'],
    Одеська: ['Одеса', 'Чорноморськ', 'Ізмаїл'],
    Полтавська: ['Полтава', 'Кременчук', 'Миргород'],
    Рівенська: ['Рівне', 'Костопіль', 'Дубно'],
    Сумська: ['Суми', 'Конотоп', 'Шостка'],
    Тернопільська: ['Тернопіль', 'Чортків', 'Бережани'],
    Черкаська: ['Черкаси', 'Сміла', 'Золотоноші'],
    Чернівецька: ['Чернівці', 'Вашківці', 'Хотин'],
    Чернігівська: ['Чернігів', 'Ніжин', 'Прилуки'],
    Харківська: ['Харків', 'Ізюм', 'Балаклея'],
    Херсонська: ['Херсон', 'Нова Каховка', 'Скадовськ'],
    Хмельницька: ['Хмельницький', 'Камʼянець-Подільський', 'Шепетівка'],
  },
};
  
  export default cityData;
  