import React from 'react';
import {Container,Title,SubTitle,Content} from './PrivacyPolicyPage.styled';

const PrivacyPolicyPage = () => {
  return (
    <Container>
      <Title>ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ ТА ЗАХИСТУ ПЕРСОНАЛЬНИХ ДАНИХ</Title>
      <Content>
        <SubTitle>Загальні положення</SubTitle>
        <p>
        в'я прагне захищати конфіденційність персональних даних (відомостей чи сукупність відомостей про фізичну особу, яка ідентифікована або може бути конкретно ідентифікована), тим самим створивши і забезпечивши максимально комфортні умови використання сервісів Сайту кожному користувачеві.
У цій Політиці конфіденційності та захисту персональних даних (далі – «Політика») встановлено порядок здійснення Компанією обробки персональних даних, види персональних даних, які збираються, цілі використання таких персональних даних, взаємодія Команії з третіми особами, заходи безпеки для захисту персональних даних, умови доступу до персональних даних, а також, контактна інформація для користувача щодо отримання доступу, внесення змін, блокування або видалення своїх персональних даних та звернення з будь-якими питаннями, які можуть виникнути у Вас щодо практики захисту персональних даних.
        </p>
        <SubTitle>Збір та використання персональних даних</SubTitle>
        <p>
        Володільцем та розпорядником персональних даних користувачів Сайту є ТОВ «ДІДЖИТАЛС СОЛЮШНС».
При використанні користувачем сервісів Сайту Компанією здійснюється обробка даних користувача, а саме:<br/>
- даних, що надаються користувачем як при заповненні реєстраційних форм, так і в процесі користування сервісами;<br/>
- файли cookie;<br/>
- ір-адреси;<br/>
- параметри і налаштувань інтернет-браузерів (User-agent).<br/>
Компанія збирає тільки ті персональні дані (наприклад, Ваше ім'я і прізвище, логін і пароль доступу, адреса електронної пошти, номер контактного телефону, дата народження, стать і т.д.), які свідомо і добровільно надані Вами як суб'єктом персональних даних в цілях використання сервісів Сайту, що відповідно до вимог законодавства є згодою суб'єкта персональних даних на обробку своїх персональних даних відповідно до сформульованої в цій Політиці мети їх обробки.
При відвідуванні Сайту фіксуються всі входи до системи. Інші відомості по трафіку користувача не обробляються і не зберігаються.
Звертаємо Вашу увагу: Компанія обмежується збором мінімального обсягу інформації, необхідного виключно для виконання запиту суб'єкта персональних даних. У будь-якому випадку, коли запитується необов'язкова до надання інформація, користувача буде повідомлено в момент збору такої інформації.
Компанія не збирає будь-яку інформацію, до обробки якої, законодавством встановлені певні вимоги, як-то інформацію про расове або етнічне походження, політичні, релігійні або світоглядні переконання, членство в політичних партіях та професійних спілках, засудження до кримінального покарання в скоєнні злочину або засудження до кримінального покарання, а також даних, що стосуються здоров'я, статевого життя, біометричних або генетичних даних (відповідно до статті 7 Закону України «Про захист персональних даних»).
Компанія збирає дані про статистику відвідування Сайту. Відомості можуть містити інформацію про з'єднання, трафік, браузер користувача, а також про дату, час, тривалість роботи в мережі Інтернет та знаходження на Сайті.

        </p>
        <p>...</p>
      </Content>
    </Container>
  );
};


export default PrivacyPolicyPage;
