import React from 'react';
import {Container,Title,Content} from './PrivacyPolicyPage.styled';

const PrivacyPolicyPage = () => {
  return (
    <Container>
      <Title>ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ ТА ЗАХИСТУ ПЕРСОНАЛЬНИХ ДАНИХ</Title>
      <Content>
        <p>Загальні положення</p>
        <p>
          Володільцем та розпорядником персональних даних користувачів Сайту є ТОВ «ДІДЖИТАЛС СОЛЮШНС». При використанні
          користувачем сервісів Сайту Компанією здійснюється обробка даних користувача...
        </p>
        <p>
          <strong>Збір та використання персональних даних</strong>
        </p>
        <p>
          Володільцем та розпорядником персональних даних користувачів Сайту є ТОВ «ДІДЖИТАЛС СОЛЮШНС». При використанні
          користувачем сервісів Сайту Компанією здійснюється обробка даних користувача, а саме: - даних, що надаються
          користувачем як при заповненні реєстраційних форм, так і в процесі користування сервісами...
        </p>
        <p>...</p>
      </Content>
    </Container>
  );
};


export default PrivacyPolicyPage;
