import React, { useState } from 'react';
import {Container,SubTitle, Question, Answer ,NavLinkStyled, StyledArrowIcon} from './FAQPage.styled'; // Импорт стилизованных компонентов

const FAQPage = () =>  {
  const [openIndex, setOpenIndex] = useState(null);

  const toggleQuestion = (index) => {
    setOpenIndex(openIndex === index ? null : index);
  };

  const faqData = [
    {
      question: '1. Чи потрібна реєстрація для використання сайту та розміщення оголошення? ',
      answer: (
        <>
        <p>Реєстрація на Tachka E безкоштовна і надає ряд переваг:</p>
        <ul className='list_ul'>
          <li>Розміщуйте безкоштовні оголошення.</li>
          <li>Отримуйте статистику.</li>
          <li>Керуйте своїми даними та оголошеннями.</li>
          <li>Будьте в курсі новин.</li>
        </ul>
          <p>Для перегляду сайту, пошуку транспортних засобів та іншої необхідної інформації реєстрація не є обов'язковою.</p>
        </>
      ),
    },
    {
      question: '2. Де я можу подати оголошення?',
      answer: (
        <>
        <p>На сайті Tachka E, скориставшись <NavLinkStyled to={'/advertisementPage'}>формою розміщення оголошення</NavLinkStyled></p>
        </>
      ),
    },
    {
      question: '3. Як опублікувати оголошення?',
      answer: (
        <>
        <p>На головній сторінці сайту натисніть кнопку «Продати» та виберіть відповідну рубрику.<br/>
        Вкажіть потрібну інформацію про автомобіль, заповнивши всі обов'язкові поля. Додати фото та опис транспортного засобу який продаєте для унікальності та ефективності оголошення!<br/>
        Бажаємо вам успішного та швидкого продажу!
        </p>
        </>
      ),
    },
    {
        question: '4. Який допустимий розмір фотографій в оголошенні?',
        answer: (
            <>
            <p>Розмір фото не повинен перевищувати 5Мбайт.</p>
            </>
          ),
      },
      {
        question: '5. Як змінити особисту інформацію?',
        answer: (
            <>
            <p>Щоб змінити особисту інформацію, потрібно:</p>
            <ul className='list_ul'>
              <li>зайти до Особистого кабінету </li>
              <li>обрати розділ “Мій профіль”</li>
              <li>змінити потрібну Вам інформацію</li>
              <li>натиснути на кнопку «Зберегти»</li>
            </ul>
            </>
          ),
      },
      {
        question: '6. Де я можу вказати свої контактні дані?',
        answer: (
            <>
            <p>Контактні дані (номер телефону, email) вказуйте у своєму особистому кабінеті.<br/>
            При розміщенні об'яв контактні дані вказуються у відповідному полі.
            </p>
            </>
          ),
      },
      {
        question: '7. Як редагувати оголошення?',
        answer: (
            <>
            <ol className='list_ol'>
              <li>клікнути на розділ «Мої оголошення» ,обрати оголошення</li>
              <li>на потрібному оголошенні натисніть «Редагувати»</li>
            </ol>
            </>
          ),
      },
      {
        question: '8. Чого варто остерігатися',
        answer: (
            <>
           <ul className='list_ul'>
              <li>Будьте дуже обережні, якщо пропозиція набагато нижча за ринкову ціну</li>
              <li>Не передавайте в заставу суму, більшу за ту, з якою Вам буде нестерпно боляче розлучитися.</li>
              <li>Не перераховуйте нікуди ваші гроші (на рахунок, на картку тощо), не оглянувши автомобіль і не побачившись із продавцем (було й таке)</li>
              <li>Ретельно перевірте документи продавця (тех. паспорт автомобіля, паспорт продавця) та зробіть їхню ксерокопію. Підпишіть з продавцем договір купівлі-продажу і тільки після цього робіть розрахунок</li>
            </ul>
            </>
          ),
      },

  ];

  return (
    <Container>
      <SubTitle>FAQ</SubTitle>
      <ul>
        {faqData.map((item, index) => (
          <li key={index}>
            <Question onClick={() => toggleQuestion(index)}>
              {item.question}
              <StyledArrowIcon rotate={openIndex === index ? 'rotate(180deg)' : 'rotate(0deg)'} />
            </Question>
            {openIndex === index && <Answer>{item.answer}</Answer>}
          </li>
        ))}
      </ul>
    </Container>
  );
}

export default FAQPage;
